[
  {
    "icon": "🐻",
    "title": "Grizzly Bear!",
    "text": "A massive grizzly charges toward the riverbank! Lewis once described one chasing him into the river. What do you do?",
    "action": "quick_choice",
    "choices": [
      { "text": "🏋 Stand tall and shout!", "result": "The bear stops, studies your group, and lumbers away. Bold move — Lewis would approve!", "good": true },
      { "text": "🌊 Back slowly toward the river", "result": "The bear loses interest and wanders off. Smart — the Corps often used the river as an escape route!", "good": true },
      { "text": "🏃 Run for the trees!", "result": "Running triggers the bear's chase instinct! It follows for 50 yards before giving up. Never run from a grizzly!", "good": false }
    ]
  },
  {
    "icon": "🌊",
    "title": "River Rapids Ahead!",
    "text": "The Missouri's current is fierce — your boats are tossed sideways! Everyone grabs their poles. How do you navigate?",
    "action": "quick_choice",
    "choices": [
      { "text": "⚓ Rope the boat to shore and portage", "result": "Safe but slow. You lose half a day hauling gear around the rapids. The Corps portaged around falls for nearly a month!", "good": true },
      { "text": "🚣 Paddle hard and push through!", "result": "Your crew powers through! Some supplies get soaked but nothing is lost. The men cheer as you clear the rapids!", "good": true },
      { "text": "⏸️ Wait for calmer waters", "result": "The river doesn't calm down. After wasting a full day, you portage anyway. Lewis noted the river 'never rests.'", "good": false }
    ]
  },
  {
    "icon": "⛈️",
    "title": "Thunderstorm on the Plains!",
    "text": "A violent thunderstorm rolls in fast. Lightning cracks across the open prairie with no shelter in sight!",
    "action": "quick_choice",
    "choices": [
      { "text": "⛺ Set up camp in a low spot", "result": "Good thinking! Clark once barely escaped a flash flood in a ravine, but your low ground stays dry. You wait out the storm safely.", "good": true },
      { "text": "🌳 Shelter under the tallest tree", "result": "Lightning strikes a tree nearby! Never shelter under tall trees in a storm. The Corps learned this the hard way.", "good": false },
      { "text": "🧭 Press on through the storm", "result": "Soaked to the bone but still moving. The Corps often had no choice but to march through rain for days.", "good": true }
    ]
  },
  {
    "icon": "🦟",
    "title": "Mosquito Swarm!",
    "text": "Clouds of mosquitoes descend on your camp! Clark wrote he 'could not keep them off my gun long enough to take aim.' Fight back!",
    "action": "tap_swat",
    "swat_target": "🦟",
    "swat_count": 8,
    "swat_time": 5,
    "success_text": "You swatted enough mosquitoes to get some relief! The Corps burned green wood to create smoke — it was the only thing that helped.",
    "fail_text": "The mosquitoes win this round! Your arms are covered in welts. The Corps endured this torment every single night on the plains."
  },
  {
    "icon": "🦌",
    "title": "Elk Herd Spotted!",
    "text": "A large herd of elk grazes nearby. The hunters need to bring down meat — the Corps ate up to 9 pounds per person per day!",
    "action": "quick_choice",
    "choices": [
      { "text": "🏹 Send the best hunters downwind", "result": "Two elk brought down cleanly! That's over 800 pounds of meat. Drouillard would be proud — he was the expedition's best hunter.", "good": true },
      { "text": "💨 Rush the herd!", "result": "The herd scatters before you get close. No meat today. Patience and skill were essential for frontier hunting.", "good": false },
      { "text": "🧮 Set snares along the trail", "result": "You catch one small elk. Not a feast, but it will keep the party fed for a couple of days.", "good": true }
    ]
  },
  {
    "icon": "🌵",
    "title": "Prickly Pear Cactus Field!",
    "text": "The trail is carpeted with prickly pear cactus. Sharp spines pierce through your moccasins with every step!",
    "action": "tap_swat",
    "swat_target": "🌵",
    "swat_count": 6,
    "swat_time": 5,
    "success_text": "You dodged most of the cactus! Lewis called prickly pear 'one of the beauties as well as the greatest pests of the plains.'",
    "fail_text": "Ouch! Your moccasins are shredded and your feet are bleeding. The men had to stop constantly to pull out spines during the Great Falls portage."
  },
  {
    "icon": "⛺",
    "title": "A Friendly Camp",
    "text": "You encounter a group of Native Americans who offer to trade. What do you bring to the meeting?",
    "action": "quick_choice",
    "choices": [
      { "text": "🎨 Trade beads and mirrors", "result": "They appreciate the colorful beads! Lewis and Clark carried 33 pounds of beads specifically for trade and diplomacy.", "good": true },
      { "text": "🎖️ Offer a Jefferson peace medal", "result": "The chief accepts the medal with ceremony. Peace medals were the most important diplomatic gifts Lewis carried.", "good": true },
      { "text": "🔫 Show your weapons to impress them", "result": "The display creates tension, not friendship. Clark learned that gifts and respect worked better than shows of force.", "good": false }
    ]
  },
  {
    "icon": "🌍",
    "title": "Fork in the River!",
    "text": "The river splits into two branches. Which fork is the true Missouri? Choose wrong and you could lose weeks!",
    "action": "quick_choice",
    "choices": [
      { "text": "⬅️ Take the left (south) fork", "result": "Correct! This happened at the Marias River. The men all voted for the north fork, but Lewis and Clark chose the south — and they were right!", "good": true },
      { "text": "➡️ Take the right (north) fork", "result": "That's the Marias River — a dead end! The Corps would have lost weeks. Lewis trusted his scientific observations over the popular vote.", "good": false },
      { "text": "🔭 Send scouts up both forks", "result": "Smart! Lewis did exactly this — he scouted the south fork for days before committing. Scientific caution saved the expedition.", "good": true }
    ]
  },
  {
    "icon": "🐺",
    "title": "Wolves at Night!",
    "text": "As darkness falls, wolves howl all around your camp. Clark noted 'a great number of wolves about us all night.' Guard the camp!",
    "action": "tap_swat",
    "swat_target": "🐺",
    "swat_count": 5,
    "swat_time": 6,
    "success_text": "You kept the wolves at bay! The sentries earned their rest. The Corps always posted guards through the night.",
    "fail_text": "The wolves got into the provisions! You lost some dried meat. The Corps learned to hang food high and keep watch."
  },
  {
    "icon": "❄️",
    "title": "Bitter Cold!",
    "text": "Temperatures plummet to -20°F! At Fort Mandan it dropped to -45°F. How does your party survive the night?",
    "action": "quick_choice",
    "choices": [
      { "text": "🔥 Build a big fire and huddle close", "result": "The fire keeps everyone warm enough to survive. At Fort Mandan, the men kept fires burning constantly for five months.", "good": true },
      { "text": "🧥 Double up the leather bedrolls", "result": "Body heat plus leather — it works! The men often slept two to a bed during the coldest nights.", "good": true },
      { "text": "🏃 Keep marching to stay warm", "result": "Marching in -20°F wastes energy fast. Several men get frostbite. Lewis noted that exposed skin 'froze in minutes.'", "good": false }
    ]
  }
]
